[
  {
    "comment": [
      "This entry is an example for an bedrock ore candidate. All field values in this",
      "entry represent the default values used if a field is omitted in an entry. Except",
      "for the block state, that'd be empty if omitted.",
      "",
      "Note that you can add as many JSON files to this directory as you like, as long",
      "as they follow the format of this one; they will all be loaded in natural sort",
      "order (i.e. `file4.json` is loaded before `file10.json`). This is relevant",
      "because entries with block states that have been loaded before will be updated",
      "with the values of a newly parsed entry, but only the fields defined are",
      "overwritten. This way you can easily change single values of built-in entries",
      "without having to copy-paste the full entry.",
      "",
      "Explanation of the fields:",
      "  enabled   -- handy to quickly disable ores without removing them ore setting",
      "               their weight to zero.",
      "  comment   -- just that, a comment field, useful to document ore settings.",
      "  state     -- defines the actual ore that will be dropped by the bedrock ore.",
      "  dimension -- allows defining what dimension *types* an ore can be generated",
      "               in. Legal values are 'overworld', 'nether' and '*' (for any).",
      "               defaults to 'overworld'.",
      "  weight    -- this defines the weight of the ore type in relation to others.",
      "               It is used to determine which ore to use when generating a vein.",
      "               A weight divided by the sum of all weights of ores that are also",
      "               valid results in the probability of the ore being picked.",
      "  width*    -- the min and max width of a vein. This defines the horizontal",
      "               'bounds' of a vein (their actual top-view shape is an ellipse).",
      "               This is more or less decorative, but the wider a vein the easier",
      "               it will be to find. Max value is 8.",
      "  count*    -- the min and max number of of blocks to generate per vein. If the",
      "               max is larger than the number of candidate blocks the yield is",
      "               simply distributed across the blocks that *do* exist.",
      "  yield*    -- the min and max amount of actual resources contained in a vein.",
      "               This is the number of times a player can harvest the bedrock ores",
      "               in the vein/the miner can pull a block from the vein. The actual",
      "               yields will be distributed across all the blocks in the vein.",
      "  group     -- Name of the group of ores this entry falls into. This is used to",
      "               group ores from different mods that represent the same thing, e.g.",
      "               'copper' together; for each group, only one entry is kept, the one",
      "               with the lowest groupOrder.",
      "  groupOder -- The order in the group of ores for this entry. Lower values are",
      "               preferred; imagine the list of grouped ores being sorted from low",
      "               to high using this number, the one with the lowest number is the",
      "               one that'll be kept."
    ],
    "state": {
      "name": "example_mod_id:example_mod_block_name",
      "properties": {
        "example_property_name": "example_property_value"
      }
    },
    "dimension": "overworld",
    "weight": 1,
    "widthMin": 2,
    "widthMax": 4,
    "heightMin": 2,
    "heightMax": 4,
    "countMin": 5,
    "countMax": 10,
    "yieldMin": 100,
    "yieldMax": 125,
    "group": ""
  }
]